<a href="https://colab.research.google.com/github/mazdah/colab_practice/blob/main/%ED%8C%A8%EC%8A%A4%ED%8A%B8%EC%BA%A0%ED%8D%BC%EC%8A%A4_%EC%A7%81%EC%9E%A5%EC%9D%B8%EC%9D%84_%EC%9C%84%ED%95%9C_%ED%8C%8C%EC%9D%B4%EC%8D%AC_%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

---
### ▶︎ 통계값
---

In [2]:
import pandas as pd

df = pd.read_csv('./korean-idol.csv')
df

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442

In [ ]:
df.describe()

                키       브랜드평판지수
count   13.000000  1.500000e+01
mean   175.792308  5.655856e+06
std      5.820576  2.539068e+06
min    162.100000  2.925442e+06
25%    174.000000  3.712344e+06
50%    177.000000  4.668615e+06
75%    179.200000  7.862214e+06
max    183.000000  1.052326e+07

In [ ]:
df["키"].min()

162.1

In [ ]:
df["키"].max()

183.0

In [ ]:
df["키"].sum()

2285.3

In [ ]:
df["키"].mean()

175.7923076923077

In [6]:
import numpy as np

---
- 분산과 표준편차 : 데이터가 평균으로부터 얼마나 떨어져있는지를 나타내는 지표
- 분산 : (데이터 - 평균) ** 2 를 모두 합한 값의 평균
- 표준편차 : 분산의 루트
- 주로 표준편차를 사용한다.
---

In [ ]:
data_01 = np.array([1, 3, 5, 7, 9])
data_02 = np.array([3, 4, 5, 6, 7])

In [ ]:
data_01.mean()

5.0

In [ ]:
data_02.mean()

5.0

In [ ]:
data_01.var(), data_02.var()

(8.0, 2.0)

In [ ]:
np.sqrt(data_01.var()), np.sqrt(data_02.var())

(2.8284271247461903, 1.4142135623730951)

In [ ]:
df["키"].var()

33.879102564102595

In [ ]:
df["키"].std()

5.820575793175672

In [ ]:
np.sqrt(df["키"].var())

5.820575793175672

In [ ]:
df["키"].count()

13

---
- 중앙값 : 오름차순으로 정렬한 후 가장 가운데에 있는 값
- 데이터가 짝수 인 경우 중앙의 2개 값의 평균을 쓰거나 둘 중 하나를 임의로 선택
---

In [ ]:
df["키"].median()

177.0

---
- 최빈값 : 가장 빈번하게 등장하는 값
---

In [ ]:
df["키"].mode()

0    178.0
dtype: float64

---
### ▶︎ 피벗 테이블

- 2개의 열을 각각 행 index, 열 index로 하여 또 다른 열의 값들을 보는 기능
- pandas pivot_table 함수의 index 파라미터는 행 index, column 파라미터는 열 index이고 values는 보고자 하는 값이다.
- 값이 중복되는 경우 중복된 값들의 평균을 표시한다. 예를들어 아래의 예에서 빅히트 소속사의 A형인 사람이 2명 이상이라면 A형인 사람의 키의 평균이 표시된다.
- aggfunc 파라미터를 이용하면 중복된 값을 어떻게 처리할지 결정할 수 있다. 주로 numpy의 함수를 이용하며, 예를들어 np.sum을 주면 중복된 값의 합을, np.mean을 주면 중복된 값으 평균을 출력하는 식이다.
---

In [3]:
pd.pivot_table(df, index="소속사", columns="혈액형", values="키")

혈액형          A     AB      B       O
소속사
RBW      162.1    NaN    NaN     NaN
YG       177.0    NaN    NaN     NaN
빅히트      175.8  178.0    NaN  176.60
스타크루이엔티  167.1    NaN    NaN     NaN
커넥트      180.0    NaN    NaN     NaN
판타지오       NaN    NaN  183.0     NaN
플레디스       NaN  175.0    NaN  179.15

In [7]:
pd.pivot_table(df, index="그룹", columns="혈액형", values="브랜드평판지수", aggfunc=np.sum)

혈액형             A         AB          B          O
그룹
뉴이스트          NaN  3301654.0        NaN  8263929.0
마마무     7650928.0        NaN        NaN        NaN
방탄소년단  15731595.0  8073501.0        NaN  7495750.0
빅뱅      9916947.0        NaN        NaN        NaN
소녀시대    3918661.0        NaN        NaN        NaN
아스트로          NaN        NaN  3506027.0        NaN
아이들           NaN        NaN  4668615.0        NaN
핫샷      4036489.0        NaN        NaN        NaN

---
### ▶︎ 그룹별 통계 (groupby)
---

In [9]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [11]:
df.groupby("소속사").count()

         이름  그룹  성별  생년월일  키  혈액형  브랜드평판지수
소속사
RBW       1   1   1     1  1    1        1
SM        1   1   1     1  0    1        1
YG        1   1   1     1  1    1        1
빅히트       5   5   5     5  5    5        5
스타크루이엔티   1   1   1     1  1    1        1
커넥트       1   0   1     1  1    1        1
큐브        1   1   1     1  0    1        1
판타지오      1   1   1     1  1    1        1
플레디스      3   3   3     3  3    3        3

In [12]:
df.groupby("그룹").mean()

                키       브랜드평판지수
그룹
뉴이스트   177.766667  3.855194e+06
마마무    162.100000  7.650928e+06
방탄소년단  176.560000  6.260169e+06
빅뱅     177.000000  9.916947e+06
소녀시대          NaN  3.918661e+06
아스트로   183.000000  3.506027e+06
아이들           NaN  4.668615e+06
핫샷     167.100000  4.036489e+06

In [15]:
df.groupby("그룹").count()

       이름  소속사  성별  생년월일  키  혈액형  브랜드평판지수
그룹
뉴이스트    3    3   3     3  3    3        3
마마무     1    1   1     1  1    1        1
방탄소년단   5    5   5     5  5    5        5
빅뱅      1    1   1     1  1    1        1
소녀시대    1    1   1     1  0    1        1
아스트로    1    1   1     1  1    1        1
아이들     1    1   1     1  0    1        1
핫샷      1    1   1     1  1    1        1

In [13]:
df.groupby("혈액형")["키"].mean()

혈액형
A     172.966667
AB    176.500000
B     183.000000
O     177.875000
Name: 키, dtype: float64

In [14]:
df.groupby("성별").sum()

         키   브랜드평판지수
성별
남자  2123.2  68599637
여자   162.1  16238204

---
### ▶︎ 복합 인덱스(multi-index)와 인덱스 초기화(reset_index)
---

In [18]:
df.groupby(["혈액형", "성별"]).mean()

              키     브랜드평판지수
혈액형 성별
A   남자  175.140  7591755.20
    여자  162.100  5784794.50
AB  남자  176.500  5687577.50
B   남자  183.000  3506027.00
    여자      NaN  4668615.00
O   남자  177.875  3939919.75

In [19]:
df2 = df.groupby(["혈액형", "성별"]).mean()

In [20]:
df2.unstack("혈액형")

          키                           브랜드평판지수
혈액형       A     AB      B        O          A         AB          B           O
성별
남자   175.14  176.5  183.0  177.875  7591755.2  5687577.5  3506027.0  3939919.75
여자   162.10    NaN    NaN      NaN  5784794.5        NaN  4668615.0         NaN

In [21]:
df2.unstack("성별")

           키            브랜드평판지수
성별        남자     여자          남자         여자
혈액형
A    175.140  162.1  7591755.20  5784794.5
AB   176.500    NaN  5687577.50        NaN
B    183.000    NaN  3506027.00  4668615.0
O    177.875    NaN  3939919.75        NaN

In [22]:
df2

              키     브랜드평판지수
혈액형 성별
A   남자  175.140  7591755.20
    여자  162.100  5784794.50
AB  남자  176.500  5687577.50
B   남자  183.000  3506027.00
    여자      NaN  4668615.00
O   남자  177.875  3939919.75

In [24]:
df3 = df2.reset_index()

In [25]:
df2

              키     브랜드평판지수
혈액형 성별
A   남자  175.140  7591755.20
    여자  162.100  5784794.50
AB  남자  176.500  5687577.50
B   남자  183.000  3506027.00
    여자      NaN  4668615.00
O   남자  177.875  3939919.75

In [26]:
df3

  혈액형  성별        키     브랜드평판지수
0   A  남자  175.140  7591755.20
1   A  여자  162.100  5784794.50
2  AB  남자  176.500  5687577.50
3   B  남자  183.000  3506027.00
4   B  여자      NaN  4668615.00
5   O  남자  177.875  3939919.75